In [1]:
import pandas as pd

In [4]:
df1 = pd.read_csv("/Users/rociocuestapedraz/Desktop/PYTHON bootcamp DS/datasets/titanic 1.csv")
df2 = pd.read_csv("/Users/rociocuestapedraz/Desktop/PYTHON bootcamp DS/datasets/titanic 2.csv")

**1. Mostrar las estadisticas de cada uno de los dataframe**

In [5]:
df1.describe()

       PassengerId         Age
count   891.000000  714.000000
mean    446.000000   29.699118
std     257.353842   14.526497
min       1.000000    0.420000
25%     223.500000   20.125000
50%     446.000000   28.000000
75%     668.500000   38.000000
max     891.000000   80.000000

In [6]:
df2.describe()

       PassengerId    Survived      Pclass        Fare
count   891.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642   32.204208
std     257.353842    0.486592    0.836071   49.693429
min       1.000000    0.000000    1.000000    0.000000
25%     223.500000    0.000000    2.000000    7.910400
50%     446.000000    0.000000    3.000000   14.454200
75%     668.500000    1.000000    3.000000   31.000000
max     891.000000    1.000000    3.000000  512.329200

**1. Unir los dataframe para obtener solo uno**

**2. Imprimir las últimas 5 filas de las columnas de nombre y edad**

**3. Imprimir las primeras 10 filas de las instancias que en sexo sean igual a femenino**

**4. Imprimir las instancias que en la columna Fare sean menor a 33 y en la columna Pclass igual a 2**

**5. Del resultado anterior obten el número de hombres y el número de mujeres**

**6. Obten el costo total de los tickets de hombres y el costo total de los tickets de mujeres**

**7. Obten el costo total de los tickets por cada clase (1, 2 y 3) y el número de pasajeros de cada clase**

**8. Crear una columna con el apellido de cada pasajero y agregala al dataframe**

**9. Encuentra si se repiten apellidos en la columna que se creo en el ejercicio anterior**

**10. Encuentra los apellidos que se repiten en la columna recien creada**

**11. Imprime los primeros 10 pasajeros que tengan un PassengerID multiplo de 3**

**12. ¿Cuales son los apellidos de los pasajeros que son mujeres y menores de 20 años?**

**12. ¿Cuales son los apellidos de los pasajeros que son hombres y mayor de 45 años?**

**13. Compara si coinciden los apellidos generados en los ejercicios anteriores**

**14. Encuentra los 10 pasajeros que no sobrevivieron más jovenes e imprime cuantos son hombres y cuantos son mujeres**

**15. En un dataframe muestra 3 pasajeros que sean hombres y 3 que sean mujeres, que hayan sobrevivido y para cada clase de la columna Pclass**

**16. Obtener el tipo de elementos de cada columna y convierte los que sean int64 a int32. Evalua la memoria que consume antes y después de convertir las columnas y comenta la diferencia**

**17. Encuentra a los pasajeros de la clase 1 y 3 entre 20 y 25 años y comprueba si son más hombres o mujeres**

**18. Agrega una nueva columna al daframe que se llame: "Rango edad" y va a catagorizar de la siguiente manera:**
- Niño < 11 años
- Joven <18 años
- Adulto < 50 años
- Mayor >= 50 años

**19. Encontrar a los pasajeros jovenes y mayores de la clase 2 y 3 que hayan sobrevivido. Imprimir los 10 primeros**

**20. Encuentra la edad promedio de todos los pasajeros y reemmplazala por los NaN en la columna de Age y ejecuta el ejercicio anterior**
- Nota: para identificar un nan utilizaremos np.nan

**21. Cambia a español la columna Sex**

**22. Convierte a mayusculas todas las columnas que los valores sean cadenas**

**23. Agrupa por sexo y rango de edad y encuentra la edad promedio**

**24. Agrupa por sobrevivientes, sexo y encuentra la edad promedio**

**25. Divide la columna name en las siguientes columnas:**
 - Mrs/Miss
 - Apellido
 - Nombre(s)
 
 
Nota: Ignora el resto de información